Revit 2024 API
CurveArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual CurveArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As CurveArrayIterator
Visual C++
public:
virtual CurveArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
CurveArray Class
Autodesk.Revit.DB Namespace